app/views/posts/index.html.erb

  <% if params[:date] == "Today" %>
    <% @posts = Post.where("created_at >=?", Time.zone.today.beginning_of_day) %>
---
SELECT "posts".* FROM "posts" WHERE (created_at>=?, Time.zone.today.beginning_of_day)