app/controllers/posts_controller.rb

  def index
    #Provide all authors for view filter control
    @authors = Author.all

    #Filter @posts list based on user input
    if !params[:author].blank?
      @posts = Post.by_author(params[:author])
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.from_today
      else
        @posts = Post.old_news
      end
    else
      #If no filter selected, show all posts
      @posts = Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at>=?, Time.zone.today.beginning_of_day)